import csv
import requests

cities = []
republics = ['Республика Татарстан', 'Республика Алтай', 'Республика Башкортостан',
             'Республика Бурятия', 'Республика Дагестан', 'Республика Ингушетия',
             'Кабардино-Балкарская Республика', 'Республика Калмыкия',
             'Карачаево-Черкесская Республика', 'Республика Карелия',
             'Республика Коми', 'Республика Марий Эл', 'Республика Мордовия',
             'Республика Саха(Якутия)', 'Республика Северная Осетия-Алания',
             'Республика Татарстан', 'Республика Тыва', 'Удмуртская Республика',
             'Республика Хакасия', 'Чеченская Республика', 'Чувашская Республика',
             'Республика Крым', 'Удмуртия', 'Кабардино-Балкария', 'Карачаево-Черкесия',
             'Чечня', 'Чувашия']
okrugs = ['ЯНАО', 'ЧАО', 'НАО', 'ХМАО', 'Ненецкий АО', 'Ненецкий автономный округ',
          'Ханты-Мансийский автономный округ', 'Чукотский автономный округ',
          'Ямало-Ненецкий автономный округ']


url = 'https://raw.githubusercontent.com/hflabs/city/master/city.csv'
def get_csv(url):
    r = requests.get(url)
    return csv.reader(r.text.strip().split('\n'))

csv = get_csv(url)
for record in csv:
    cities.append(record[0].rsplit(' ', 1)[-1])
cities.pop(0)